### Python Library for Data Analysis

#### Pandas - Data Analysis

- Series Object - 1D Data
- Data Frame Object - 2D Data
- Processing / Accessing Data Frames
    - Columns
    - Rows
- Updating DataFrames
- Writing DataFrames back to csv file.

In [48]:
# Function to read CSV data into a DataFrame and returns the DataFrame Object.

filepath = 'Packages/income.csv'

import pandas as pd
def readCSVdata(filepath):
    return pd.read_csv(filepath)

readCSVdata(filepath)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [49]:
incomedf = readCSVdata(filepath)

# Function to print all column names in a single line.

# GEOID State 2005 2006 ........ 2012 2013
def printDataFrameColumns(df):
    for i in df.columns:
        print(i,end =' ')
    return
printDataFrameColumns(incomedf)

GEOID State 2005 2006 2007 2008 2009 2010 2011 2012 2013

In [50]:
# Function to access a row based on unique column value.

def accessDataFrameRow(df,key):
    for row in df.values:
        if key in row:
            for item in row:
                print(item,end = ' ')

    return    
accessDataFrameRow(incomedf,'04000US01')

04000US01 Alabama 37150 37952 42212 44476 39980 40933 42590 43464 41381

In [13]:
for row in incomedf.values:
    print(row[1])

Alabama
Alaska
Arizona
Arkansas
California

In [14]:
def highRemainder(n):
    print((n//2)+1)
            
highRemainder(2)

2

In [52]:
# Accessing a unique value based on row, column
# Income of a state in a given year

def getRowIndex(df,row_key):
    for i in range(len(df.values)):
        if df.values[i][0] == row_key or df.values[i][1] == row_key: # df.values[i][0] = GEOID, df.values[i][1] = State
            row_index = i
    return row_index

def getColumnIndex(df,column_key):
    for i in range(len(df.columns)):
        if df.columns[i] == column_key:
            column_index = i
    return column_index

def valueFromRowColumn(df, row_key, column_key):
    row_index = getRowIndex(df, row_key)
    column_index = getColumnIndex(df,column_key)
    return df.values[row_index][column_index]
        
valueFromRowColumn(incomedf, '04000US06', '2009')

56134

In [53]:
# Function to update data based on rowkey and columnkey
def updateValueFromRowColumn(df, row_key, column_key, new_data):
    row_index = getRowIndex(df, row_key)
    column_index = getColumnIndex(df,column_key)
    row = df.values[row_index]
    row[column_index] = new_data
    df.loc[row_index] = row
    return    
updateValueFromRowColumn(incomedf, '04000US06', '2009' , 62993)  
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,62993,54283,53367,57020,57528

In [55]:
# Function to add new row of data to dataframe

def addRowDataToDataFrame(df,rowdata):
    lastRowIndex = len(df.values)-1
    df.loc[lastRowIndex+1] = rowdata
    return
rowdata = [1,2,3,4,5,6,7,8,9,10,11]
addRowDataToDataFrame(incomedf,rowdata)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,62993,54283,53367,57020,57528
5,1,2,3,4,5,6,7,8,9,10,11
6,1,2,3,4,5,6,7,8,9,10,11

In [71]:
def addRowDataToDataFrame(df,rowdata):
    df.loc[2] = rowdata
    return
rowdata = ['04000US04','Arizona',45245,46657,47215,46914,45739,46896,48621,47044,50602]
addRowDataToDataFrame(incomedf,rowdata)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,62993,54283,53367,57020,57528
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602

## TASKS

In [95]:
# Combined Average income of all states from 2005 to 2013

def averageIncome(df):
    sum = 0
    c= 0
    for row in df.values:
        for i in range(2,11):
            sum = sum + row[i]
            c += 1
    return (sum//c)
            
averageIncome(incomedf)

48677

In [184]:
# second method for above function

def avgIncome(df):
    sum = 0
    c = 0
    for row in df.values:
        sum = sum + (row[2:].mean())
        c += 1
    return (sum//c)
avgIncome(incomedf)

41126.444444444445
79955.33333333334
136067.8888888889
196174.44444444447
243389.22222222225

48677.0

In [149]:
# State with highest average income in the last three years

import math as m
def highestAverageIncome(df):
    highestAvgIncome = 0
    avg = 0
    state = ''
    for row in df.values:
        avg = (row[-3:].mean())
        a = m.floor(avg)
        print(row[1],a)
        if a > highestAvgIncome:
            highestAvgIncome = a
            state = row[1]
    return state            
highestAverageIncome(incomedf)

Alabama 42478
Arkansas 40079
California 55971
Alaska 60738
Arizona 48755

'Alaska'

In [171]:
# State with lowest average income from 2007 to 2010(inclusive)

def getClIndex(df,cl_key):
    for i in range(len(df.columns)):
        if df.columns[i] == cl_key:
            cl_index = i
    return cl_index
        
def lowestAvgIncome(df,st_year,ed_year):
    lowest_avg_income = 100000
    avg = 0
    state = ''
    st_cl_index = getClIndex(df,st_year)
    ed_cl_index = getClIndex(df,ed_year)
    for row in df.values:
        avg = ((row[st_cl_index:ed_cl_index+1]).mean())
        print(row[1],avg)
        if avg < lowest_avg_income:
            lowest_avg_income = avg
            state = row[1]
    return state
          
lowestAvgIncome(incomedf,'2007','2010')

Alabama 41900.25
Arkansas 38876.5
California 57506.0
Alaska 61608.5
Arizona 46691.0

'Arkansas'

In [187]:
# Print the list of all states in the same line with average income less than California
def getRowIndex(df,row_key):
    for i in range(len(df.values)):
        if df.values[i][1] == row_key:
            row_index = i
    return row_index

def allStatesLessCalifornia(df):
    row_index = getRowIndex(df,'California')
    avg = 0
    california_avg = df.values[row_index][2:].mean()
    #print(california_avg)
    for row in df.values:
        avg = row[2:].mean()
        #print(row[1],avg)
        if avg < california_avg:
            print(row[1],end = ' ')
        
allStatesLessCalifornia(incomedf)

Alabama Arkansas Arizona

In [202]:
# Print the names of states based on descending order of income in the year 2009

def statesIncomeDecending(df):
    cl_index = getClIndex(df,'2009')
    income = {}
    for row in df.values:
        income[row[1]] = row[cl_index]
    income = sorted(income.items(),key=lambda kv: kv[1],reverse = True) # To sort dictionary based on values we use "key=lambda kv: kv[1]"
    print(income)
    for item in income:
        print(item[0])
statesIncomeDecending(incomedf)

[('California', 62993), ('Alaska', 61604), ('Arizona', 45739), ('Alabama', 39980), ('Arkansas', 36538)]
California
Alaska
Arizona
Alabama
Arkansas

In [215]:
# State with the lowest recorded income from 2005 to 2013

def lowestRecordedIncome(df,st_year,ed_year):
    st_year_index = getClIndex(df,st_year)
    ed_year_index = getClIndex(df,ed_year)
    min_income = 100000
    state = ''
    print(st_year_index,ed_year_index)
    for row in df.values:
        income_list = row[st_year_index:ed_year_index+1]
        print(row[1],min(income_list))
        if min(income_list) < min_income:
            min_income = min(income_list)
            state = row[1]
    return state
lowestRecordedIncome(incomedf,'2005','2013')

2 10
Alabama 37150
Arkansas 36538
California 51755
Alaska 55891
Arizona 45245

'Arkansas'

In [217]:
s = ['apssdc','training','abc','abcd','ab','hello']
min = 'abcdefghijklmnopqrstuvwxyz'
for i in s:
    if i < min:
        min = i
print(min)

ab